## Pandas GroupBy Operations

### Understanding groupby objects

In [1]:
import pandas as pd

In [2]:
titanic = pd.read_csv('titanic.csv')

In [3]:
titanic.head()

   survived  pclass     sex   age  sibsp  parch     fare embarked deck
0         0       3    male  22.0      1      0   7.2500        S  NaN
1         1       1  female  38.0      1      0  71.2833        C    C
2         1       3  female  26.0      0      0   7.9250        S  NaN
3         1       1  female  35.0      1      0  53.1000        S    C
4         0       3    male  35.0      0      0   8.0500        S  NaN

In [4]:
titanic_slice = titanic.iloc[:10, [2,3]]

In [5]:
titanic_slice

      sex   age
0    male  22.0
1  female  38.0
2  female  26.0
3  female  35.0
4    male  35.0
5    male   NaN
6    male  54.0
7    male   2.0
8  female  27.0
9  female  14.0

groupby()

In [6]:
titanic_slice.groupby('sex')   # it's a groupby object

In [7]:
gbo = titanic_slice.groupby('sex')

In [8]:
type(gbo)

pandas.core.groupby.generic.DataFrameGroupBy

In [9]:
gbo.groups    # accessing the groups within gbo

{'female': [1, 2, 3, 8, 9], 'male': [0, 4, 5, 6, 7]}

In [10]:
l = list(gbo)   # passing it to a list

In [11]:
l

[('female',
        sex   age
  1  female  38.0
  2  female  26.0
  3  female  35.0
  8  female  27.0
  9  female  14.0),
 ('male',
      sex   age
  0  male  22.0
  4  male  35.0
  5  male   NaN
  6  male  54.0
  7  male   2.0)]

In [13]:
len(l)

2

In [14]:
l[0]

('female',
       sex   age
 1  female  38.0
 2  female  26.0
 3  female  35.0
 8  female  27.0
 9  female  14.0)

In [15]:
type(l[0])

tuple

In [16]:
l[0][0]  # string

'female'

In [18]:
l[0][1]  # second element in the first tuple is a dataframe

      sex   age
1  female  38.0
2  female  26.0
3  female  35.0
8  female  27.0
9  female  14.0

In [20]:
l[1][1]

    sex   age
0  male  22.0
4  male  35.0
5  male   NaN
6  male  54.0
7  male   2.0

In [22]:
titanic_slice_f = titanic_slice.loc[titanic_slice.sex == 'female']
titanic_slice_f

      sex   age
1  female  38.0
2  female  26.0
3  female  35.0
8  female  27.0
9  female  14.0

In [23]:
titanic_slice_m = titanic_slice.loc[titanic_slice.sex == 'male']
titanic_slice_m

    sex   age
0  male  22.0
4  male  35.0
5  male   NaN
6  male  54.0
7  male   2.0

In [24]:
titanic_slice_f.equals(l[0][1])   # both are same!

True

In [28]:
for x in gbo:       # printing the dataframes within gbo which are at index 1 in each tuple
    print(x[1])

      sex   age
1  female  38.0
2  female  26.0
3  female  35.0
8  female  27.0
9  female  14.0
    sex   age
0  male  22.0
4  male  35.0
5  male   NaN
6  male  54.0
7  male   2.0

## Splitting with many keys